<template>
  <div class="user-agreement">
    <p>
      Настоящее Пользовательское соглашение регулирует отношения между
      ООО «MyDigital» (далее именуемое – Express 24), и
      пользователем сети Интернет (далее – Пользователь) по использованию сервиса Express 24.
    </p>
    <p>
      Перед тем как начать использовать сервис Express 24,
      Пользователь обязан ознакомиться с настоящим Пользовательским
      соглашением и присоединиться к нему.
    </p>

    <p>
      Пользователь присоединяется к настоящему Пользовательскому
      Соглашению путем совершения одного из следующих
      действий:
    </p>

    <p>
      Нажатие кнопки «Зарегистрироваться» при регистрации на сайте
      <a class="link font-normal" href="https://express24.uz">express24.uz</a>,
      приложении MyTaxi или Express 24;
    </p>

    <p>
      Нажатие кнопки «Заказать» при оформлении заказа Пользователем без авторизации на сайте
      express24.uz либо приложении Express 24, в том числе, мобильном либо приложении в социальных
      сетях (далее по тексту настоящего Соглашения именуемые – Сайт)
    </p>

    <p>
      Настоящее Пользовательское соглашение приравнивается к договору, составленному в письменной
      форме. Принимая настоящее Пользовательское Соглашение, Пользователь выражает полное и
      безоговорочное согласие со всеми его условиями, в том числе, в части предоставления согласия
      Express 24 на обработку персональных данных Пользователя на условиях,
      указанных в разделе 8 настоящего Пользовательского соглашения, и в части предоставления
      согласия Express 24 на получение e-mail, SMS и иных видов рассылок информационного
      и рекламного содержания.
    </p>

    <h1>
      1. Предмет Пользовательского Соглашения
    </h1>
    <div class="divider" aria-hidden="true"></div>

    <p>
      1.1 Express 24 предлагает Пользователю доступ к сервису быстрого поиска и заказа готовой еды
      на условиях, предусмотренных настоящим Пользовательским соглашением.
    </p>
    <p>
      1.2 Настоящее соглашение может быть изменено Express 24 в одностороннем порядке без
      предварительного уведомления. Новая редакция Соглашения вступает в силу с момента ее
      опубликования на странице сайта, если иное не предусмотрено новой редакцией Соглашения.
    </p>
    <p>
      1.3 Пользователь вправе отказаться от принятия изменений Соглашения, осуществленных
      Express 24, что означает отказ Пользователя от использования сервиса Express 24.
    </p>

    <h1>2. Описание услуг</h1>
    <div class="divider"></div>

    <p>
      2.1 Express 24 является единой информационной системой заказов, которая предлагает
      пользователям широкие возможности для быстрого и простого поиска и заказа готовой еды,
      реализуемой Партнерами Express 24, а также принимает от Пользователей денежные средства
      в счет оплаты заказов. Обязательства по реализации продуктов, согласно условиям оформленного
      заказа Пользователя, возникают непосредственно у Партнера Express 24.
    </p>
    <p>
      2.2 Указанные услуги носят информационный характер и оказываются Пользователю безвозмездно.
    </p>
    <p>
      2.3 Пользователь соглашается с тем, что все услуги предоставляются «как есть» и что
      Express 24 не несет ответственность за качество поставляемых продуктов за задержки, сбои,
      неверную или несвоевременную доставку, а также за сбои в работе платежных систем.
    </p>
    <p>
      2.4 Для того, чтобы воспользоваться услугами службами Express 24, необходимо иметь
      компьютер/иное электронное устройство с возможностью доступа в Интернет (WWW).
    </p>

    <p> 2.5 Пользователь самостоятельно оформляет Заказ на Сайте.</p>
    <p> 2.6 Пользователь оплачивает заказ одним из доступных способов:</p>
    <p>
      2.6.1 непосредственно при получении заказа от службы доставки (Партнера Express 24) наличными
      денежными средствами или иными способами, предоставленными Партнером Express 24;
    </p>

    <p>
      2.6.2 on-line оплата на Сайте Express 24 банковской картой
      <strong>ONLINE-карты UZCARD</strong> через платежную систему ООО «INSPIRED» (т.м. Paycom),
      и OOO “Click” (т.м. Click). Все дополнительные расходы по перечислению денежных средств
      за заказ несёт Пользователь.
    </p>
    <p>
      При выборе on-line оплаты после оформления Заказа Пользователь будет перенаправлен на
      защищенную платежную страницу
      ООО «INSPIRED» (т.м. Paycom), где ему необходимо ввести данные его банковской карты.
      Для дополнительной аутентификации держателя карты используется sms подтверждение с уникальным
      кодом, который необходимо ввести в соответствующее поле. Sms отправляет сервис PayMe
      на мобильный номер привязанный к карте. Информацию о правилах и методах дополнительной
      идентификации Пользователь может уточнить в Банке, выдавшем его банковскую карту.
    </p>
    <p>
      Представленная к оплате сумма является стоимостью Заказа и Услуг (таких как доставка,
      упаковка и т.д.).
    </p>
    <p>
      Безопасность обработки Интернет-платежей гарантирует ООО «INSPIRED» (т.м. Paycom).
      Все операции с платежными картами происходят в соответствии с требованиями платежных систем
      на основе действующего законодательства Республики Узбекистан от 24 сентября 2004 года № 445,
      «О мерах по дальнейшему развитию системы расчетов на основе пластиковых карточек» и
      Постановлением Президента Республики Узбекистан от 3 августа 2006 года № ПП-433
      «О дополнительных мерах по дальнейшему развитию системы безналичных расчетов на основе
      пластиковых карточек».
      <a class="link" href="http://uzcard.uz/index.php/ru/about-company">
        http://uzcard.uz/index.php/ru/about-company
      </a>
      При передаче информации
      используется специальные технологии безопасности карточных онлайн-платежей, обработка данных
      ведется на безопасном высокотехнологичном сервере процессинговой компании.
    </p>

    <p>
      При наличии вопросов по совершенному платежу, Пользователь может обратиться в службу
      поддержки клиентов по телефону +998 71 202-65-00 (для Ташкента и Ташкентской Области).
    </p>
    <p>
      Пользователь имеет возможность привязать банковскую карту к своему Личному кабинету.
      В дальнейшем сумма любого последующего Заказа Пользователя будет списываться автоматически с
      прикрепленной к Личному кабинету банковской карты
      без указания реквизитов, при подтверждении платежа с его стороны путем нажатия кнопки
      «Оплатить» в корзине Личного кабинета и ввода одноразового пароля, в случае, если банк-эмитент
      банковской карты клиента предусматривает использование данной защиты.
    </p>
    <p>
      2.7 В случае отказа Пользователя от Заказа, либо в случае нарушения Партнерами Express 24
      условий реализации продукции, в том числе, но не ограничиваясь: в случае одностороннего отказа
      от реализации продукции, нарушения срока доставки или несоответствия качества продукции
      и т.п.,
      <strong>
        Пользователь обязан в течение 24 часов с момента наступления времени
        доставки/получения Заказа сообщить службе поддержки
      </strong> Express 24, либо по e-mail адресу
      <a href="mailto:express@mytaxi.uz" class="link">
        express@mytaxi.uz
      </a>
      о своём отказе от Заказа, для дальнейшего возмещения денежных средств.
    </p>
    <p>
      Возврат денежных средств в течение 2 (двух) дней с момента оплаты Заказа производится
      Express 24.
    </p>
    <p>
      По истечении 2 (двух) дней с момента оплаты Заказа при неполучении Express 24 уведомления от
      Пользователя об отказе от Заказа и возврате денежных средств, Заказ считается выполненным,
      денежные средства за него возврату не подлежат.
    </p>
    <p>
      Возврат денежных средств, оплаченных Пользователем через Сайт банковской картой,
      осуществляется только на ту карту, с которой была произведена оплата.
    </p>
    <p>
      2.8 После оформления заказа Пользователь имеет право сделать отмену только в случае, если
      заказ еще не был приготовлен. Если заказ уже готов, Пользователь обязан оплатить заказ.
      В случае отказа Пользователя от оплаты заказа после его приготовления, заведение, в котором
      он был сделан либо Express 24 оставляют за собой право обратиться в суд за возмещением суммы
      заказа с Пользователя. Исключением являются заказы, которые не были выполнены в течение более
      2х часов после оформления по вине заведения или Express 24. В случае столь сильной задержки,
      пользователь также имеет право отказаться от заказа.
    </p>
    <p>
      2.9 Express 24 вправе отказать Пользователю в оформлении Заказа с формой оплаты "наличными или
      онлайн платежом", если ранее оформленные Заказы Пользователя не были доставлены по его вине
      (например, если Пользователь не открыл дверь или не ответил по телефону курьеру при доставке
      Заказа, или Пользователь указал несуществующий адрес доставки и т.п.).
    </p>
    <p>
      2.10 Авторизация операций по банковским картам осуществляется банком. Если у банка есть
      основания полагать, что операция носит мошеннический характер, то банк вправе отказать в
      осуществлении данной операции. Мошеннические операции с банковскими картами являются
      уголовным преступлением.
    </p>
    <p>
      2.11. Во избежание случаев мошенничества при оплате банковскими картами платежи, оплаченные
      банковской картой, могут проверяться Express 24 в рамках имеющихся возможностей.
    </p>
    <h1>3. Обязательства по использованию сервиса</h1>
    <div class="divider"></div>

    <p>
      3.1. Пользователь соглашается предоставить достоверную, полную и актуальную информацию по
      вопросам, предлагаемым в форме заказа и/или форме регистрации.
    </p>
    <p>
      3.2. Если Пользователь предоставляет неверную/некорректную информацию или у Express 24 есть
      серьезные основания полагать, что предоставленная им информация неверна, неполна или неточна,
      Express 24 имеет право приостановить либо отменить регистрацию пользователя и отказать ему
      в использовании сервиса.
    </p>
    <p>
      3.3. Express 24 оставляет за собой право отказать Пользователю в применении сервиса
      Express 24 без уведомления Пользователя и/или без объяснения причин.
    </p>
    <p>
      3.4. Пользователь вправе оформить не более 3 (трех) заказов с применением любых промокодов в
      сутки.
    </p>
    <p>
      3.5. Пользователю может быть предоставлен промокод на определенный номинал для последующего
      его использования при приобретении услуг и/или товаров Express 24. Таким промокодом можно
      воспользоваться только один раз.
    </p>
    <p>
      3.5.1 В случае если номинал промокода больше или равен стоимости заказа, то скидка составляет
      100 % стоимости заказа, уменьшенная на 1 (один) сум, при этом, разница между стоимостью заказа
      и номиналом промокода не выплачивается. Промокод действует только на заказ, на услуги доставки
      не распространяется;
    </p>
    <p>
      3.5.2 В случае если номинал промокода меньше стоимости заказа, Пользователь в момент
      совершения заказа должен будет оплатить разницу между общей суммой заказа, совершенного
      на Сайте Express 24, и суммой номинала промокода;
    </p>
    <p>
      3.6. Express 24 вправе проводить рекламные акции, в соответствии с которыми Пользователю
      могут быть начислены дополнительные баллы/выдаваться промокоды (их количество, порядок
      зачисления, иные условия определяются Express
      24) при условии обязательного выполнения Пользователем действий, необходимых для участия в
      таких акциях.
    </p>

    <h1> 4. Регистрация Пользователя</h1>
    <div class="divider"></div>
    <p>
      4.1. Пользователь соглашается пройти процедуру регистрации на Сайте, заполнив форму
      регистрации и выразив согласие с условиями Соглашения путем подтверждения пункта
      «Я принимаю условия Соглашения».
    </p>
    <p>
      4.2. По завершении процесса регистрации Пользователь получает логин и пароль для доступа
      в Личный кабинет.
    </p>
    <p>
      4.3. Пользователь несет ответственность за безопасность своего логина и пароля, а также за
      все, что будет сделано на Сайте Express 24 под его логином и паролем.
    </p>
    <p>
      4.4. Пользователь соглашается с тем, что он обязан немедленно уведомить Express 24 о любом
      случае неавторизованного (не разрешенного) доступа со своим логином и паролем и/или о любом
      нарушении безопасности.
    </p>
  </div>
</template>

<script>
export default {
  name: 'UserAgreement',
};
</script>

<style scoped lang="scss">
.user-agreement {
  @apply py-10 text-sm;

  h1 {
    @apply text-xl font-bold;
  }

  .divider {
    @apply w-full h-0.5 bg-gray my-3;
  }

  p {
    @apply my-4;
  }
}
</style>
